In [1]:
import pandas as pd

In [2]:
df =pd.read_csv('data/people2.csv')
df

     name            clan                  email
0     Ali         Sagaras        ali@sagaras.com
1    Raib           Bulan         raib@bulan.com
2    Seli        Matahari      seli@matahari.com
3     Ily  Matahari Minor  ily@matahariminor.com
4   Lumpu          Nebula       lumpu@nebula.com
5  Kosong          Nebula      kosong@nebula.com

## Sorting by a column

In [3]:
df.sort_values(by='name')

     name            clan                  email
0     Ali         Sagaras        ali@sagaras.com
3     Ily  Matahari Minor  ily@matahariminor.com
5  Kosong          Nebula      kosong@nebula.com
4   Lumpu          Nebula       lumpu@nebula.com
1    Raib           Bulan         raib@bulan.com
2    Seli        Matahari      seli@matahari.com

In [10]:
df.sort_values(by='name', ascending=False)

     name            clan                  email
2    Seli        Matahari      seli@matahari.com
1    Raib           Bulan         raib@bulan.com
4   Lumpu          Nebula       lumpu@nebula.com
5  Kosong          Nebula      kosong@nebula.com
3     Ily  Matahari Minor  ily@matahariminor.com
0     Ali         Sagaras        ali@sagaras.com

## Sorting by multiple columns

In [7]:
df.sort_values(by=['name', 'clan'], ascending=False)

     name            clan                  email
2    Seli        Matahari      seli@matahari.com
1    Raib           Bulan         raib@bulan.com
4   Lumpu          Nebula       lumpu@nebula.com
5  Kosong          Nebula      kosong@nebula.com
3     Ily  Matahari Minor  ily@matahariminor.com
0     Ali         Sagaras        ali@sagaras.com

In [12]:
df.sort_values(by=['name', 'clan'], ascending=[True, True], inplace=True)

In [13]:
df

     name            clan                  email
0     Ali         Sagaras        ali@sagaras.com
3     Ily  Matahari Minor  ily@matahariminor.com
5  Kosong          Nebula      kosong@nebula.com
4   Lumpu          Nebula       lumpu@nebula.com
1    Raib           Bulan         raib@bulan.com
2    Seli        Matahari      seli@matahari.com

## Sorting by index

In [14]:
df.sort_index()

     name            clan                  email
0     Ali         Sagaras        ali@sagaras.com
1    Raib           Bulan         raib@bulan.com
2    Seli        Matahari      seli@matahari.com
3     Ily  Matahari Minor  ily@matahariminor.com
4   Lumpu          Nebula       lumpu@nebula.com
5  Kosong          Nebula      kosong@nebula.com

## Sorting a series

In [15]:
df['clan'].sort_values()

1             Bulan
2          Matahari
3    Matahari Minor
5            Nebula
4            Nebula
0           Sagaras
Name: clan, dtype: object